[
  "Grateful Baker’s Parcel: free rations stash appears next mission; +1 Renown if used to feed others.",
  "Mistaken Credit: a temple is praised for your deed; −1 Notoriety, but they now expect support later.",
  "Loose Tongue Urchin: eager urchin touts embellished rumours; +1 Renown, +1 Notoriety.",
  "Kindly Watchman: off‑duty guard tips a patrol route; next mission in that ward gains advantage on Stealth.",
  "Slum Fire: unrelated blaze forces reroute; lose 1 time unit or risk +1 Notoriety.",
  "Petty Rival: another do‑gooder group poaches your ground; Renown +0 this mission unless you escalate next time (Sabotage ×1.5).",
  "Rumour Twist: your gift is blamed on a guild; −1 Notoriety, but that guild is miffed (minor friction later).",
  "Sick Child: urgent plea mid‑op; divert 10 gp to avoid +1 Notoriety.",
  "Found Ledger: tiny cache of enemy notes; +1 Renown and intel boon on next Sabotage.",
  "Street Song: a cryptic ballad emerges; +1 Renown, but Signature +1 next op unless you change MO.",
  "Watch Census: benign questioning wave; DC 12 Deception to avoid +1 Notoriety.",
  "Counterfeit Tokens: shoddy imitations of your sign appear; Signature +1 next mission unless discarded.",
  "Grifter Poses As You: compensate victims (15 gp) or +1 Notoriety.",
  "Grateful Thug: a small gang owes you; +1 help die to Intimidation in Trades/South Ward once.",
  "Shifting Turf: Dock Ward clampdown; missions there suffer +1 Visibility for a week.",
  "Unseen Ally: Harperish note — 'Keep to shadows.' Gain 1 Harper Ping (advantage on one Investigation).",
  "Curious Cat: Xanathar spotter cat tails you; DC 12 Animal Handling or +1 Notoriety.",
  "Guild Tithe Whisper: foreman hints at fees; pay 10 gp for −1 Notoriety or gain a 'watchful eye' tag.",
  "Magic Prickle: hedge‑mage notices a trace; next magic in‑op adds +1 Magic Trace unless countered (Arcana DC 12).",
  "Wrong Door: you nearly blunder into a private wake; apologise (lose time) or press on (+1 Witnesses).",
  "Dock Fog: heavy mist lowers Visibility by 1 but raises Noise by 1 on this op.",
  "Festival Crowds: Witnesses +1, but Concealment +1 for non‑violent ops.",
  "Free Bread Day: merchants donate; −10 gp cost on 'Help the Poor' this week.",
  "Quiet Night: reduce Notoriety gain by 1 (min 0) for tonight’s mission."
]