[
  "Decoy Sting: staged poorhouse run by informants; pass DC 14 Insight/Perception or +2 Notoriety.",
  "Arcane Net: citywide divination sweep; any spell cast triggers Trace test at DC 14.",
  "Impostor Crew: criminals use your sign; spend 50 gp to clean up (−2 Notoriety) or ignore (+1 Signature, +1 Notoriety now and later).",
  "Black Robe on a Balcony: Watchful Order notes patterns; repeat MO this week adds +2 Notoriety.",
  "Bounty Whisper: streets pay 1 gp for leads; all Witnesses count +1 this mission.",
  "Rival Retaliation: Zhent/Xanathar spoilers ambush a contact; fight/skill scene or lose a Safehouse use until answered.",
  "False Flag Success: planted lead works too well; −2 Notoriety but the framed faction quietly hates your vibe.",
  "Curfew Blitz: patrol surge; +2 DC to Stealth or abort and lose this mission’s Renown.",
  "Silent Bell: your signal is stolen; first contact no‑shows — 50% chance of other group arriving (complicates scene).",
  "Arcane Residue Marker: prior site glows to detect magic; reuse route this week → +2 Notoriety.",
  "Scry Glint: unfocused scry attempts; Disguise checks −2 this mission unless warded.",
  "Noble 'Benefactor' Offer: gain 100 gp Resources for +1 Notoriety now and a debt tag later.",
  "Deputised Toughs: private enforcers conduct stops; fail DC 14 Deception → lose kit or +2 Notoriety.",
  "Inside Leak: ally questioned; spend 25 gp on counsel to prevent +1 Notoriety and losing the contact.",
  "Sanctified Roadblock: processions clog escape; detour (time loss) or +1 Visibility & +1 Witnesses.",
  "Magister’s Notice: legal brief condemns masked vigilantism; disadvantage with officials until Notoriety < 10.",
  "Snitch Economy: buy silence (30 gp) for −1 Notoriety or accept +1 Witnesses tag for the week.",
  "Echoed Calling Card: copied graffiti; next mission Signature +2 unless you rebrand.",
  "'Clean‑Up Crew' Shadows You: third party sanitises scene; if hostile, +1 Notoriety and lose one stash.",
  "Masked Lord’s Algorithm: act twice in same ward → +1 Notoriety each time until you rotate.",
  "Rival Scry Anchor: someone planted a minor anchor; +1 Magic Trace until purged (50 gp, Arcana DC 14).",
  "Spy in the Choir: temple volunteer reports movements; Misdirection −1 this week.",
  "Greased Wheels: a Watch sergeant is bribed on your behalf; −1 Notoriety now, but next Expose gains +1 base heat.",
  "Alchemical Whiff: unusual scents trail you; Signature +1 and Noise +1 this mission."
]